# Taps
tap "common-fate/granted"

# CLI Tools
brew "bat"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "lazygit"
brew "stow"
brew "tree"
brew "woff2"
brew "xpdf"
brew "zoxide"

# Other
brew "gemini-cli"
brew "webp"

# Apps - Productivity
cask "1password"
cask "1password-cli"
cask "alfred"
cask "logi-options+"
cask "nordvpn"
cask "rectangle"
cask "zoom"

# Apps - Development
cask "cursor"
cask "datagrip"
cask "docker-desktop"
cask "figma"
cask "insomnia"
cask "ngrok"

# Apps - AI
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "codexbar"
cask "granola"
cask "kiro-cli"

# Apps - Browsers
cask "google-chrome"

# Apps - Media
cask "vlc"

# VS Code Extensions
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "bierner.markdown-checkbox"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "drknoxy.eslint-disable-snippets"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fosshaas.fontsize-shortcuts"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ryu1kn.partial-diff"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "thinker.sort-json"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "zhihaocui.ts-interface-sorter"
vscode "zhuangtongfa.material-theme"
